"""
Даны три различных целых числа. Напишите программу, которая находит серединное значение из этих чисел.

Формат входных данных
На вход программе подаются три различных целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести серединное значение из набора трёх чисел.

Примечание. Серединное значение набора чисел – это число, которое находится в середине этого набора, если его упорядочить по возрастанию.
"""
a1 = int(input())
a2 = int(input())
a3 = int(input())
if a1 < a2 and a1 > a3: print(a1)
elif a1 < a3 and a1 > a2: print(a1)
elif a2 < a1 and a2 > a3: print(a2)
elif a2 < a3 and a2 > a1: print(a2)
elif a3 < a1 and a3 > a2: print(a3)
elif a3 < a2 and a3 > a1: print(a3)
