"""
Используя срезы, дополните приведённый ниже код так, чтобы он вывел первые 12 символов строки s.
"""
"""
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[:12])
"""

"""
Используя срезы, дополните приведённый ниже код так, чтобы он вывел последние 9 символов строки s.
"""
"""
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[len(s) - 9:])
"""

"""
Используя срезы, дополните приведённый ниже код так, чтобы он вывел каждый 7 символ строки s (начиная с 0-го индекса).
"""
"""
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[::7])
"""

"""
Используя срезы, дополните приведённый ниже код так, чтобы он вывел строку s в обратном порядке.
"""
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[::-1])
